{
  "title": "How Danone Does Their Internal Giveaways Competition Using Twibbonize",
  "publishedDate": "1704938439000",
  "readtime": "2",
  "content": [
        {
            "image": "/assets/img/marketings/testimonials-danone-1.jpg"
        },
        {
            "paragraph": "As Danone Indonesia’s Internal Communication Manager, Rinda Lestari is the one of the people that stand behind Danone Indonesia’s many campaigns on Twibbonize. Our platform has been her go-to option when it comes to optimizing any of their company-wide internal events, which happens pretty often. It all began when one of her colleagues recommended the idea of using Twibbonize by 2021 to promote Danone’s event of their annual kick-off meeting, which she then gave a try."
        },
        {
            "paragraph": "Since her first trial of experience in using Twibbonize, she found our platform to be incredibly easy and simple to use. When she learned how everybody else is really happy to use Twibbon, as a way to show their participation in their internal event, she really does not have another reason to not use Twibbonize. In Rinda Lestari’s opinion, Twibbonize is the kind of platform that people can use to increase the awareness of any type of movement or campaign they are doing, so more people can be aware of it, and join along. And the fact that most people love taking a picture of themselves, makes Twibbonize to be the perfect tool for them to use for promotional purposes, as it allows people to do what they love (taking a picture of themselves), while doing it for something good."
        },
        {
            "paragraph": "Behind Danone Indonesia’s constant high number of campaign supporters, Rinda mentioned that all the employees would voluntarily be enthusiastic in using Twibbonize as a way of participating in their internal event, with no such force needed. Even when another division in the company made their own campaign, with a topic that is only related to a certain division, the rest of the workers there would be happy to show their support by participating in the campaign as well. However, to spark the employee’s interest in participating, from time to time Rinda would create a simple competition that would be held internally, where the winner with the most creative or interesting Twibbonize photo, would get a prize. We suppose doing giveaways with Twibbonize is a real thing out there then!"
        }
  ]
}